# NoLoopsPath3d Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..NoLoopsPath3d Property
BuiltInFailures..::..SketchFailures Class See Also
---
Sketch is empty.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoLoopsPath3d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoLoopsPath3d As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoLoopsPath3d {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace